2024-0605-02)숫자 데이터 타입

    -NUMBER 사용하여 저장
    (사용형식)
      컬럼명 NUMBER
        - 시스템이 가장 효율적인 공간 확보
        
      컬럼명 NUMBER[(P[,S])]
        - P : 전체자리수 (1~38사이의 정수 사용)
        - S : (양수) : 소숫점 이하의 자리수(-84 ~ 127, default는 0)
              (음수) : 정수부분의 자리수
            
    사용예)
    ---------------------------------------------------------------------
        선언         데이터             기억되는 값
    ---------------------------------------------------------------------
     NUMBER        12345.6789         12345.6789
     NUMBER(*,2)   12345.6789         12345.68
     NUMBER(7,3)   12345.6789         
     NUMBER(7,2)   12345.6789         12345.68
     NUMBER(7)     12345.6789         12346
     NUMBER(7,-2)  12345.6789         12300
     ---------------------------------------------------------------------
     
     CREATE TABLE TBL_NUM(
        COL1 NUMBER,
        COL2 NUMBER(*,2),
        COL3 NUMBER(7,3),
        COL4 NUMBER(7,2),
        COL5 NUMBER(7),
        COL6 NUMBER(7,-2)
        );
        
    INSERT INTO TBL_NUM VALUES(12345.6789, 12345.6789, 1234.6789,
                                12345.6789, 12345.6789, 12345.6789)
                                
    SELECT * FROM TBL_NUM;